web/tutorials/precice/from_tut/mono/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         2.0;

deltaT          0.001;

writeControl timeStep;

writeInterval 10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

maxAlphaCo      1;

maxDeltaT       1;


//libs ("libpreciceAdapterFunctionObject.so");
//functions
//{
//    preCICE_Adapter
//    {
//        type preciceAdapterFunctionObject;
//        errors strict; // Available since OpenFOAM v2012
//    }
//}
